fix: correcting architecture diagram in readme
